app/controllers/products_controller.rb

  def create
    @product = Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "dcs"], ["price", 19], ["created_at", "2020-01-24 02:01:59.179144"], ["updated_at", "2020-01-24 02:01:59.179144"], ["inventory", 2000], ["description", "sdcscsc"]]